wrk_rps_merged/12
Running 5m test @ http://10.111.41.71:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 201.656ms, rate sampling interval: 969ms
  Thread calibration: mean lat.: 190.092ms, rate sampling interval: 986ms
  Thread calibration: mean lat.: 205.914ms, rate sampling interval: 982ms
  Thread calibration: mean lat.: 205.046ms, rate sampling interval: 990ms
  Thread calibration: mean lat.: 207.577ms, rate sampling interval: 1011ms
  Thread calibration: mean lat.: 208.893ms, rate sampling interval: 966ms
  Thread calibration: mean lat.: 211.562ms, rate sampling interval: 1044ms
  Thread calibration: mean lat.: 214.951ms, rate sampling interval: 1010ms
  Thread calibration: mean lat.: 215.032ms, rate sampling interval: 1000ms
  Thread calibration: mean lat.: 224.218ms, rate sampling interval: 1091ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   333.76ms  216.79ms   2.36s    72.87%
    Req/Sec     9.61      2.89    21.00     84.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  297.21ms
 75.000%  454.14ms
 90.000%  569.85ms
 99.000%    1.16s 
 99.900%    1.66s 
 99.990%    2.36s 
 99.999%    2.36s 
100.000%    2.36s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.469     0.000000            1         1.00
      79.103     0.100000         2903         1.11
     173.951     0.200000         5806         1.25
     195.455     0.300000         8706         1.43
     266.495     0.400000        11604         1.67
     297.215     0.500000        14505         2.00
     347.647     0.550000        15965         2.22
     360.703     0.600000        17421         2.50
     374.271     0.650000        18875         2.86
     437.247     0.700000        20319         3.33
     454.143     0.750000        21779         4.00
     460.799     0.775000        22493         4.44
     468.479     0.800000        23211         5.00
     481.279     0.825000        23942         5.71
     540.671     0.850000        24687         6.67
     554.495     0.875000        25387         8.00
     561.663     0.887500        25768         8.89
     569.855     0.900000        26118        10.00
     581.631     0.912500        26486        11.43
     638.463     0.925000        26835        13.33
     655.359     0.937500        27202        16.00
     664.575     0.943750        27384        17.78
     673.791     0.950000        27560        20.00
     687.103     0.956250        27742        22.86
     742.911     0.962500        27924        26.67
     763.391     0.968750        28104        32.00
     773.631     0.971875        28195        35.56
     786.943     0.975000        28289        40.00
     852.479     0.978125        28377        45.71
     869.887     0.981250        28471        53.33
     895.487     0.984375        28557        64.00
     951.807     0.985938        28603        71.11
     978.431     0.987500        28649        80.00
    1099.775     0.989062        28693        91.43
    1172.479     0.990625        28739       106.67
    1240.063     0.992188        28784       128.00
    1249.279     0.992969        28810       142.22
    1259.519     0.993750        28830       160.00
    1274.879     0.994531        28854       182.86
    1330.175     0.995313        28875       213.33
    1353.727     0.996094        28897       256.00
    1363.967     0.996484        28911       284.44
    1373.183     0.996875        28920       320.00
    1438.719     0.997266        28932       365.71
    1454.079     0.997656        28943       426.67
    1551.359     0.998047        28954       512.00
    1567.743     0.998242        28964       568.89
    1568.767     0.998437        28965       640.00
    1644.543     0.998633        28971       731.43
    1652.735     0.998828        28979       853.33
    1656.831     0.999023        28982      1024.00
    1660.927     0.999121        28985      1137.78
    1674.239     0.999219        28988      1280.00
    1701.887     0.999316        28991      1462.86
    1734.655     0.999414        28995      1706.67
    1737.727     0.999512        28996      2048.00
    1744.895     0.999561        28998      2275.56
    1747.967     0.999609        28999      2560.00
    2273.279     0.999658        29001      2925.71
    2357.247     0.999707        29005      3413.33
    2357.247     0.999756        29005      4096.00
    2357.247     0.999780        29005      4551.11
    2357.247     0.999805        29005      5120.00
    2359.295     0.999829        29006      5851.43
    2359.295     0.999854        29006      6826.67
    2361.343     0.999878        29007      8192.00
    2361.343     0.999890        29007      9102.22
    2363.391     0.999902        29010     10240.00
    2363.391     1.000000        29010          inf
#[Mean    =      333.758, StdDeviation   =      216.791]
#[Max     =     2361.344, Total count    =        29010]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30043 requests in 5.00m, 145.79MB read
  Non-2xx or 3xx responses: 500
Requests/sec:    100.12
Transfer/sec:    497.51KB