wrk_rps_merged/187
Running 5m test @ http://10.111.208.77:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 266.711ms, rate sampling interval: 1090ms
  Thread calibration: mean lat.: 285.431ms, rate sampling interval: 1257ms
  Thread calibration: mean lat.: 281.416ms, rate sampling interval: 1105ms
  Thread calibration: mean lat.: 286.875ms, rate sampling interval: 1094ms
  Thread calibration: mean lat.: 287.170ms, rate sampling interval: 1105ms
  Thread calibration: mean lat.: 282.470ms, rate sampling interval: 1087ms
  Thread calibration: mean lat.: 302.779ms, rate sampling interval: 1303ms
  Thread calibration: mean lat.: 273.555ms, rate sampling interval: 1116ms
  Thread calibration: mean lat.: 287.099ms, rate sampling interval: 1083ms
  Thread calibration: mean lat.: 281.427ms, rate sampling interval: 1081ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   268.89ms  171.45ms   1.47s    68.87%
    Req/Sec     9.58      2.79    20.00     86.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  251.39ms
 75.000%  354.56ms
 90.000%  467.97ms
 99.000%  761.34ms
 99.900%    1.23s 
 99.990%    1.45s 
 99.999%    1.47s 
100.000%    1.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.535     0.000000            1         1.00
      51.871     0.100000         2908         1.11
     140.543     0.200000         5815         1.25
     163.071     0.300000         8724         1.43
     227.839     0.400000        11637         1.67
     251.391     0.500000        14539         2.00
     261.631     0.550000        16003         2.22
     316.415     0.600000        17444         2.50
     328.447     0.650000        18905         2.86
     339.967     0.700000        20374         3.33
     354.559     0.750000        21824         4.00
     370.431     0.775000        22536         4.44
     417.023     0.800000        23284         5.00
     426.239     0.825000        23997         5.71
     435.967     0.850000        24714         6.67
     447.743     0.875000        25441         8.00
     455.423     0.887500        25809         8.89
     467.967     0.900000        26168        10.00
     515.327     0.912500        26530        11.43
     525.311     0.925000        26908        13.33
     536.575     0.937500        27257        16.00
     542.719     0.943750        27453        17.78
     548.351     0.950000        27632        20.00
     556.031     0.956250        27809        22.86
     566.783     0.962500        27987        26.67
     595.455     0.968750        28165        32.00
     624.639     0.971875        28259        35.56
     634.367     0.975000        28349        40.00
     646.143     0.978125        28440        45.71
     656.383     0.981250        28530        53.33
     671.743     0.984375        28621        64.00
     718.335     0.985938        28665        71.11
     740.863     0.987500        28710        80.00
     752.127     0.989062        28758        91.43
     767.999     0.990625        28801       106.67
     844.287     0.992188        28846       128.00
     850.943     0.992969        28869       142.22
     863.743     0.993750        28893       160.00
     872.447     0.994531        28915       182.86
     925.695     0.995313        28937       213.33
     945.151     0.996094        28960       256.00
     950.271     0.996484        28971       284.44
     956.927     0.996875        28983       320.00
     968.191     0.997266        28994       365.71
    1017.855     0.997656        29005       426.67
    1073.151     0.998047        29017       512.00
    1113.087     0.998242        29022       568.89
    1120.255     0.998437        29029       640.00
    1143.807     0.998633        29034       731.43
    1158.143     0.998828        29039       853.33
    1238.015     0.999023        29045      1024.00
    1270.783     0.999121        29048      1137.78
    1314.815     0.999219        29051      1280.00
    1316.863     0.999316        29058      1462.86
    1316.863     0.999414        29058      1706.67
    1319.935     0.999512        29059      2048.00
    1412.095     0.999561        29061      2275.56
    1428.479     0.999609        29062      2560.00
    1444.863     0.999658        29065      2925.71
    1444.863     0.999707        29065      3413.33
    1445.887     0.999756        29067      4096.00
    1445.887     0.999780        29067      4551.11
    1446.911     0.999805        29068      5120.00
    1448.959     0.999829        29069      5851.43
    1448.959     0.999854        29069      6826.67
    1451.007     0.999878        29070      8192.00
    1451.007     0.999890        29070      9102.22
    1461.247     0.999902        29071     10240.00
    1461.247     0.999915        29071     11702.86
    1461.247     0.999927        29071     13653.33
    1466.367     0.999939        29072     16384.00
    1466.367     0.999945        29072     18204.44
    1466.367     0.999951        29072     20480.00
    1466.367     0.999957        29072     23405.71
    1466.367     0.999963        29072     27306.67
    1467.391     0.999969        29073     32768.00
    1467.391     1.000000        29073          inf
#[Mean    =      268.895, StdDeviation   =      171.448]
#[Max     =     1466.368, Total count    =        29073]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30045 requests in 5.00m, 168.86MB read
Requests/sec:    100.13
Transfer/sec:    576.24KB